InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РасчетныеПроцедурыСервер/Ext/Module.bsl
Функция ОпределитьКурс(Дата, Валюта) экспорт 
	
	Если Валюта <> Справочники.Валюты.Рубль Тогда  				
		ВалютаСтруктура = Новый Структура;
		ВалютаСтруктура.Вставить("Валюта",Валюта);
		
		Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,ВалютаСтруктура).Курс;   		
	Иначе // если в рублях
		Курс = 1;
	КонецЕсли; 
	
	Возврат Курс;
КонецФункции  



Функция НайтиЦену(Дата, Номенклатура, ВидЦены, Валюта) экспорт 
	
	Если ЗначениеЗаполнено(Валюта) Тогда		
		//Вернуть цену с учетом курса указанной в документе валюты
		Курс = ОпределитьКурс(Дата,Валюта); 
		Если Курс <> 0 Тогда 
			//Получить из регистра сведений ЦеныНоменклатуры последнее значение цены в разрезе номенклатуры и вида цены
			СтруктураОтбор = Новый Структура;
			СтруктураОтбор.Вставить("Номенклатура", Номенклатура);   
			СтруктураОтбор.Вставить("ВидЦены", ВидЦены); 
			
			Цена = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(Дата,СтруктураОтбор).Цена / Курс; 
 
			Возврат Цена; 
		Иначе	
			Сообщить("Курс " + Валюта + " не задан!"); 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
